Fixed graph and documentation
